app/Controllers/Admin/Admins.php

SELECT *
FROM `admins`
ORDER BY `id` ASC
---
    public function index(): string
    {
        $currentRole = session()->get('admin_role');
        $showDev = ($this->request->getGet('show_dev') === '1') && ($currentRole === 'Developer');

        $query = $this->adminModel->orderBy('id', 'ASC');