app/Controllers/Admin/Articles.php

    public function index(): string
    {
        $keyword  = $this->request->getGet('q');
        $category = $this->request->getGet('category');
        $status   = $this->request->getGet('status');

        $builder = $this->articleModel;

        if (!empty($keyword)) {
            $builder->groupStart()
                    ->like('title', $keyword)
                    ->orLike('author_name', $keyword)
                    ->groupEnd();
        }

        if (!empty($category)) {
            $builder->where('category', $category);
        }

        if (!empty($status)) {
            $builder->where('status', $status);
        }

        $articles = $builder->orderBy('created_at', 'DESC')->paginate(10);
        $pager    = $this->articleModel->pager;

        $categories = $this->articleModel->select('category')
                                          ->distinct()
                                          ->findAll();
---
SELECT *
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL
SELECT DISTINCT `category`
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL