app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `properties`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'Tersedia'
AND `properties`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'Booking'
AND `properties`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'Terjual'
AND `properties`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `leads`
SELECT COUNT(*) AS `numrows`
FROM `admins`
---
    public function index(): string
    {
        $propertyModel = new PropertyModel();
        $leadModel     = new LeadModel();
        $adminModel    = new AdminModel();

        // Statistics
        $totalProperties     = $propertyModel->countAllResults();
        $availableProperties = $propertyModel->where('status', 'Tersedia')->countAllResults();
        $bookingProperties   = $propertyModel->where('status', 'Booking')->countAllResults();
        $soldProperties      = $propertyModel->where('status', 'Terjual')->countAllResults();
        $totalLeads          = $leadModel->countAllResults();
        $totalAdmins         = $adminModel->countAllResults();