app/Controllers/Admin/Siteplan.php

SELECT *
FROM `siteplans`
WHERE `deleted_at` IS NULL
AND `siteplans`.`deleted_at` IS NULL
ORDER BY `id` DESC
---
    public function index(): string
    {
        $siteplans = $this->siteplanModel->where('deleted_at', null)->orderBy('id', 'DESC')->findAll();