app/Filters/RoleGuard.php

SELECT *
FROM `admins`
WHERE `admins`.`id` = 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        if (!$session->get('is_admin_logged_in')) {
            return redirect()->to(site_url('admin/login'))->with('error', 'Sesi Anda telah berakhir, silakan login kembali.');
        }

        // Refresh user role from DB if logged in to ensure immediate sync
        $adminId = $session->get('admin_id');
        if ($adminId) {
            $adminModel = new \App\Models\AdminModel();
            $admin = $adminModel->find($adminId);