app/Filters/VisitorTracker.php

        // Insert log safely without blocking page response
        try {
            $db = \Config\Database::connect();
            $db->table('visitor_logs')->insert([
                'ip_address'   => $ip,
                'page_url'     => $pathUrl,
                'page_title'   => null,
                'source'       => $source,
                'device'       => $device,
                'user_agent'   => substr($agentStr, 0, 255),
                'visited_date' => $today,
                'created_at'   => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `visitor_logs` (`ip_address`, `page_url`, `page_title`, `source`, `device`, `user_agent`, `visited_date`, `created_at`) VALUES ('127.0.0.1', '/index.php/admin/google-seo', NULL, 'Direct', 'Desktop', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/154.0.0.0 Safari/537.36', '2026-09-26', '2026-09-26 02:48:58')