app/Controllers/Auth.php

    public function processLogin()
    {
        $session = session();

        $rules = [
            'username' => [
                'rules'  => 'required',
                'errors' => ['required' => 'Username atau Email wajib diisi.']
            ],
            'password' => [
                'rules'  => 'required',
                'errors' => ['required' => 'Password wajib diisi.']
            ],
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $loginInput = trim((string) $this->request->getPost('username'));
        $password   = (string) $this->request->getPost('password');

        $adminModel = new AdminModel();

        // Find admin by username OR email
        $admin = $adminModel->where('username', $loginInput)
                            ->orWhere('email', $loginInput)
                            ->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'superadmin'
OR `email` = 'superadmin'
 LIMIT 1