app/Models/ArticleModel.php

    public function getPublishedArticles(int $perPage = 6, ?string $category = null, ?string $keyword = null)
    {
        $builder = $this->where('status', 'published');

        if (!empty($category)) {
            $builder->where('category', $category);
        }

        if (!empty($keyword)) {
            $builder->groupStart()
                    ->like('title', $keyword)
                    ->orLike('excerpt', $keyword)
                    ->orLike('content', $keyword)
                    ->groupEnd();
        }

        return $builder->orderBy('created_at', 'DESC')->paginate($perPage);
---
SELECT *
FROM `articles`
WHERE `status` = 'published'
AND `articles`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `status` = 'published'
AND `articles`.`deleted_at` IS NULL

    public function getRecentArticles(int $limit = 4, ?int $excludeId = null): array
    {
        $builder = $this->where('status', 'published');

        if ($excludeId !== null) {
            $builder->where('id !=', $excludeId);
        }

        return $builder->orderBy('created_at', 'DESC')
                       ->findAll($limit);
---
SELECT *
FROM `articles`
WHERE `status` = 'published'
AND `articles`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 4

    public function getCategories(): array
    {
        return $this->select('category, COUNT(id) as total')
                    ->where('status', 'published')
                    ->groupBy('category')
                    ->orderBy('total', 'DESC')
                    ->findAll();
---
SELECT `category`, COUNT(id) as total
FROM `articles`
WHERE `status` = 'published'
AND `articles`.`deleted_at` IS NULL
GROUP BY `category`
ORDER BY `total` DESC