app/Models/LeadModel.php

SELECT `leads`.*, `properties`.`title` as `property_title`, `properties`.`slug` as `property_slug`
FROM `leads`
LEFT JOIN `properties` ON `properties`.`id` = `leads`.`property_id`
ORDER BY `leads`.`created_at` DESC
---
    public function getLeadsWithProperty(): array
    {
        return $this->select('leads.*, properties.title as property_title, properties.slug as property_slug')
                    ->join('properties', 'properties.id = leads.property_id', 'left')
                    ->orderBy('leads.created_at', 'DESC')
                    ->findAll();