app/Models/SettingModel.php

    public function getAllSettings(): array
    {
        $settings = cache(self::CACHE_KEY);
        if ($settings !== null && is_array($settings)) {
            return $settings;
        }

        try {
            $records = $this->findAll();
---
SELECT *
FROM `settings`

    public function updateSettingsBatch(array $data): bool
    {
        $batch = [];
        foreach ($data as $key => $value) {
            // Check if key exists
            $existing = $this->where('setting_key', $key)->first();
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'company_name'
 LIMIT 1