app/Models/SiteplanModel.php

    public function getActiveSiteplans(): array
    {
        return $this->where('is_active', 1)
                    ->where('deleted_at', null)
                    ->orderBy('id', 'ASC')
                    ->findAll();
---
SELECT *
FROM `siteplans`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
AND `siteplans`.`deleted_at` IS NULL
ORDER BY `id` ASC